Pymoo/cases/base-case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2500;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	forces
	{
	    type            	forces;
	    libs            	("libforces.so");
	    patches         	( airfoil );
		verbose 			true;
		log 				true;
	    p               	p;
	    U               	U;
		rho 	    	    rhoInf;
		rhoInf  	    	1.225;
	    pRef            	0;
	    porosity        	no;
		outputControl 		timeStep;
		outputInterval 		1;
	    CofR          		(0.25 0 0);
	}
}

// ************************************************************************* //
