Pymoo/cases/base-case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          220;
        startFace       145345;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       145565;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          380;
        startFace       145765;
    }
    lower
    {
        type            patch;
        nFaces          255;
        startFace       146145;
    }
    upper
    {
        type            patch;
        nFaces          255;
        startFace       146400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          146000;
        startFace       146655;
    }
)

// ************************************************************************* //
